MoonModules/projectMM/src/platform/esp32/platform_esp32_improv.cpp
/// @defgroup platform_esp32_improv The serial provisioning listener
/// The serial and native-USB command dispatch.
///
/// Self-contained: it owns its state privately and reaches the rest of the layer only through declared accessors.
///
/// @moreinfo
///
/// ## It runs on every target, wireless or not
///
/// The serial transport and the vendor commands need no radio, so the installer can push a device model's config over serial to a wired device too.
/// Only the provisioning commands and their radio calls are guarded out.
/// A wired build does not offer those, having no station to provision, and the state query reports on the wired link instead.
///
/// ## Two transports, because the port may be either
///
/// Several chips have a built-in USB peripheral exposing a serial endpoint with no bridge chip, and many cheap boards wire the socket to it rather than to the hardware port.
/// So the bytes arrive on one or the other, and both are listened on, which makes one firmware work on either kind of board.
/// The install is soft-failing: when the secondary console grabbed the peripheral first, that path is skipped and the hardware port carries on alone.
///
/// One parser per transport, each keeping its own framing state and buffer.
/// A shared one would let a partial frame on one side be corrupted by bytes arriving on the other, its state machine not knowing they came from different sources.
/// Both are polled symmetrically, draining whichever has data and yielding only when both come up empty: an earlier shape blocked on one and starved the other.
///
/// ## Replies go back the way the request came
///
/// The task is single-threaded and handles one frame at a time, so one stored source is enough, set before dispatch and read by every send within it.
/// Broadcasting to both stays available for status messages during startup, which reply to no particular request.
/// A send on the USB path never blocks: a host that opened the endpoint without draining it would otherwise stall the task.
/// And a reply dropped there is retried by the installer.
///
/// ## The two vendor operations
///
/// One carries a transmit-power cap, the escape hatch for a board whose supply browns out at full power.
/// Its cap normally arrives over the network once the device is online, which such a board can never reach.
/// It fails to associate before any of that exists, proven on the bench.
/// This carries the cap over the same serial channel as the credentials, so it persists before the first association attempt.
///
/// The other carries one operation as a document, the same shape the network interface takes, so the installer can apply device-model defaults while it owns the port.
/// Most fit one frame and a long value is chunked, with reassembly and the duplicate guard living in a core helper that is tested without hardware.
/// Each frame is acknowledged so the installer can pace and retry, and the reassembled operation is applied on the main loop rather than this task.

#include "platform/platform.h"

#include "core/util/ImprovFrame.h"
#include "core/util/ImprovOpReassembler.h"

#include "driver/uart.h"
#include "esp_log.h"
#ifndef MM_NO_WIFI
#include "esp_wifi.h"   // only the WiFi-provisioning RPCs touch esp_wifi_*
#endif
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "improv.h"
#include "soc/soc_caps.h"

// The built-in USB peripheral, which many boards wire their socket to instead of the hardware port: @xref{two-transports-because-the-port-may-be-either|why both are listened on}.
#if SOC_USB_SERIAL_JTAG_SUPPORTED
#include "driver/usb_serial_jtag.h"
#endif

#include <atomic>
#include <cstdarg>
#include <cstdio>
#include <cstring>
#include <string>
#include <vector>

namespace mm::platform {
namespace {

// Improv-serial framing, see src/core/ImprovFrame.h. That header carries the parser, builder, and checksum, all unit-tested at test/test_improv_frame.cpp. This task only does the IO + RPC dispatch.

// Shared with the Improv task; const after init.
struct ImprovTaskState {
    char name[33] = {};               // copied from ImprovDeviceInfo at init
    char chipFamily[16] = {};
    char firmwareVersion[16] = {};
    char* ssidOut = nullptr;          // module-owned buffers (NetworkModule's
    char* passwordOut = nullptr;      // ssid_ / password_ via the module)
    size_t ssidOutLen = 0;
    size_t passwordOutLen = 0;
    std::atomic<bool>* ready = nullptr;   // module polls and clears
    char* statusBuf = nullptr;        // module shows as `provision_status`
    size_t statusBufLen = 0;

    // Vendor SET_TX_POWER RPC (command 0xFD): pre-association TX-power cap in whole dBm for brown-out-prone boards. Same producer/consumer dance.
    uint8_t* txPowerOut = nullptr;
    std::atomic<bool>* txPowerReady = nullptr;

    // The operation buffer and its ready flag, the same producer and consumer dance as the credentials: @xref{the-two-vendor-operations|what it carries}. Module-owned and sized for the largest operation; only these two are shared state here.
    char* opOut = nullptr;
    size_t opOutLen = 0;
    std::atomic<bool>* opReady = nullptr;
};
static ImprovTaskState g_improv;  // single global — only one Improv task per device

static const char* IMPROV_TAG = "mm_improv";  // ESP_LOG* tag for the Improv task

static void improvSetStatus(const char* fmt, ...) {
    if (!g_improv.statusBuf || g_improv.statusBufLen == 0) return;
    va_list args;
    va_start(args, fmt);
    std::vsnprintf(g_improv.statusBuf, g_improv.statusBufLen, fmt, args);
    va_end(args);
}

// Whether the USB read driver is up, which gates sending on that transport so a board without it never writes into a dead peripheral. Read and written on the same task, so a plain flag is enough.
#if SOC_USB_SERIAL_JTAG_SUPPORTED
static bool g_jtagReady = false;
#endif

// Which transport a reply goes back on: @xref{replies-go-back-the-way-the-request-came|why one stored value suffices}.
enum class ImprovSource : uint8_t { Both, Uart, Jtag };
static ImprovSource g_replySource = ImprovSource::Both;

// Send a framed message, routed to the transport that received the request being replied to, or broadcast when no particular source is set. The frame-type values match the upstream protocol numerically; the host test path keeps its own enumeration rather than including that header.
static void improvSend(ImprovFrameType type, const std::vector<uint8_t>& payload) {
    uint8_t frame[6 + 1 + 1 + 1 + kImprovMaxPayload + 1];
    size_t n = buildImprovFrame(type, payload.data(), payload.size(),
                                frame, sizeof(frame));
    if (n == 0) return;  // oversize payload — caller bug, silently drop
    const bool toUart =
#if SOC_USB_SERIAL_JTAG_SUPPORTED
        (g_replySource != ImprovSource::Jtag);
#else
        true;
#endif
    if (toUart) {
        uart_write_bytes(UART_NUM_0, reinterpret_cast<const char*>(frame), n);
    }
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (g_jtagReady && g_replySource != ImprovSource::Uart) {
        // Non-blocking, so a host that opened the endpoint without draining cannot stall the task: what fits is queued and the rest dropped, and the installer retries. Replies are small and fit one transaction on any healthy host.
        usb_serial_jtag_write_bytes(frame, n, 0);
    }
#endif
}

static void improvSendCurrentState(improv::State state) {
    improvSend(ImprovFrameType::CurrentState, {static_cast<uint8_t>(state)});
}

static void improvSendError(improv::Error err) {
    improvSend(ImprovFrameType::ErrorState, {static_cast<uint8_t>(err)});
}

