MoonModules/projectMM/src/platform/esp32/platform_esp32_improv.cpp
static void improvSendDeviceInfo() {
    // RPC response: [type=GET_DEVICE_INFO][len][n strings].
    std::vector<std::string> data = {
        "MoonLight",                            // firmware name
        g_improv.firmwareVersion,
        g_improv.chipFamily,
        g_improv.name,
    };
    auto rpc = improv::build_rpc_response(improv::GET_DEVICE_INFO, data, false);
    improvSend(ImprovFrameType::RpcResponse, rpc);
}

#ifndef MM_NO_WIFI
// --- WiFi-provisioning RPCs: only on WiFi builds. On Ethernet-only (MM_NO_WIFI)
// these aren't offered (no STA to provision) and the esp_wifi_* calls aren't linked. ---

static void improvSendWifiNetworks() {
    // One network per frame as the protocol specifies, then an empty payload to end the list, bounded to keep the response set small.
    // The scan needs the radio started, which on the chip whose radio lives on a companion happens only after its own prelude.
    // A scan before that returns an error cleanly rather than scanning a cold link.
    wifi_scan_config_t scan_cfg = {};
    if (esp_wifi_scan_start(&scan_cfg, true /*block*/) != ESP_OK) {
        improvSendError(improv::ERROR_UNKNOWN);
        return;
    }
    uint16_t n = 0;
    esp_wifi_scan_get_ap_num(&n);
    if (n > 10) n = 10;
    wifi_ap_record_t records[10] = {};
    esp_wifi_scan_get_ap_records(&n, records);
    for (uint16_t i = 0; i < n; i++) {
        char rssi[8];
        std::snprintf(rssi, sizeof(rssi), "%d", static_cast<int>(records[i].rssi));
        std::vector<std::string> data = {
            reinterpret_cast<const char*>(records[i].ssid),
            rssi,
            records[i].authmode == WIFI_AUTH_OPEN ? "NO" : "YES",
        };
        auto rpc = improv::build_rpc_response(improv::GET_WIFI_NETWORKS, data, false);
        improvSend(ImprovFrameType::RpcResponse, rpc);
    }
    // End-of-list sentinel: empty payload.
    improvSend(ImprovFrameType::RpcResponse,
               improv::build_rpc_response(improv::GET_WIFI_NETWORKS, {}, false));
}

// Stash the credentials for the module to consume on its own tick, rather than bringing the radio up from the parser task's stack.
static void improvHandleProvision(const improv::ImprovCommand& cmd) {
    if (wifiStaConnected()) {
        improvSetStatus("error: already connected");
        improvSendError(improv::ERROR_UNABLE_TO_CONNECT);
        return;
    }
    improvSetStatus("received credentials");
    std::strncpy(g_improv.ssidOut, cmd.ssid.c_str(), g_improv.ssidOutLen - 1);
    g_improv.ssidOut[g_improv.ssidOutLen - 1] = 0;
    std::strncpy(g_improv.passwordOut, cmd.password.c_str(), g_improv.passwordOutLen - 1);
    g_improv.passwordOut[g_improv.passwordOutLen - 1] = 0;
    // release-store: pairs with the module's acquire-load in tick1s() so the SSID/password buffer writes above are visible before the consumer sees ready=true (matters on the dual-core ESP32-S3; single-core ESP32 is a no-op but the explicit ordering documents intent).
    g_improv.ready->store(true, std::memory_order_release);
    improvSendCurrentState(improv::STATE_PROVISIONING);

    // Wait up to 30 s for a usable IP. Polls existing platform state, no extra wiring. Loop until the lease actually lands (a non-zero address), not merely until association: DHCP completes shortly after WIFI_EVENT_STA_CONNECTED, so breaking on wifiStaConnected() alone could read 0.0.0.0.
    uint8_t ip[4] = {};
    for (int i = 0; i < 300; i++) {  // 30 s @ 100 ms
        vTaskDelay(pdMS_TO_TICKS(100));
        if (wifiStaConnected()) {
            wifiStaGetIPv4(ip);
            if (ip[0] || ip[1] || ip[2] || ip[3]) break;   // have a real address
        }
    }
    // No usable lease (never associated, or associated but DHCP never completed) is a failure, same as the timeout, http://0.0.0.0/ would be worse than an honest error.
    if (!ip[0] && !ip[1] && !ip[2] && !ip[3]) {
        improvSetStatus("error: no IP after 30s");
        improvSendError(improv::ERROR_UNABLE_TO_CONNECT);
        return;
    }
    improvSetStatus("connected: %s", cmd.ssid.c_str());
    // Success frame: RPC response carrying the device URL. Format the dotted-quad inline (platform layer doesn't pull core/Control.h's formatDottedQuad).
    char url[64];
    std::snprintf(url, sizeof(url), "http://%u.%u.%u.%u/", ip[0], ip[1], ip[2], ip[3]);
    std::vector<std::string> urls = { url };
    auto rpc = improv::build_rpc_response(improv::WIFI_SETTINGS, urls, false);
    improvSend(ImprovFrameType::RpcResponse, rpc);
    improvSendCurrentState(improv::STATE_PROVISIONED);
}

#endif // MM_NO_WIFI — end WiFi-provisioning RPCs

// The transmit-power operation, the escape hatch for a board that browns out at full power: @xref{the-two-vendor-operations|why it must arrive before association}. The payload is one byte of whole decibels, zero lifting any cap; the module's tick persists and applies it.
static constexpr uint8_t IMPROV_CMD_SET_TX_POWER = 0xFD;
static constexpr uint8_t IMPROV_ERROR_INVALID_TX_POWER = 0x81;

static void improvHandleSetTxPower(const uint8_t* payload, uint8_t len) {
    if (!g_improv.txPowerOut || !g_improv.txPowerReady) {
        improvSendError(improv::ERROR_UNKNOWN_RPC);
        return;
    }
    // payload[0] = command (dispatched on), payload[1] = data_len, payload[2] = dBm.
    if (len != 3 || payload[1] != 1 || payload[2] > 21) {
        improvSendError(static_cast<improv::Error>(IMPROV_ERROR_INVALID_TX_POWER));
        return;
    }
    *g_improv.txPowerOut = payload[2];
    // release-store pairs with the module's acquire-load in tick1s().
    g_improv.txPowerReady->store(true, std::memory_order_release);
    auto rpc = improv::build_rpc_response(
        static_cast<improv::Command>(IMPROV_CMD_SET_TX_POWER),
        std::vector<std::string>{}, false);
    improvSend(ImprovFrameType::RpcResponse, rpc);
}

// The apply operation, carrying one request as a document in the same shape the network interface takes: @xref{the-two-vendor-operations|why over serial}.
// The payload is a chunk index, a last flag and a slice.
// The first index resets the buffer and the last one marks it ready for the main loop to apply.
static constexpr uint8_t IMPROV_CMD_APPLY_OP = 0xFC;
static constexpr uint8_t IMPROV_ERROR_INVALID_OP = 0x82;

static void improvHandleApplyOp(const uint8_t* payload, uint8_t len) {
    if (!g_improv.opOut || !g_improv.opReady) {
        improvSendError(improv::ERROR_UNKNOWN_RPC);
        return;
    }
    // Single-buffered: refuse a new op while the module hasn't consumed the previous one (opReady still set), so a fast installer can't overwrite an unapplied op. The installer treats this error as "retry shortly" and re-sends. Acquire-load pairs with the module's release-store when it clears the flag after applying.
    if (g_improv.opReady->load(std::memory_order_acquire)) {
        improvSendError(static_cast<improv::Error>(IMPROV_ERROR_INVALID_OP));
        return;
    }
    // [0xFC][seq][last] header = 3 bytes; chunk is the rest.
    if (len < 3) {
        improvSendError(static_cast<improv::Error>(IMPROV_ERROR_INVALID_OP));
        return;
    }
    uint8_t seq = payload[1];
    uint8_t last = payload[2];
    const uint8_t* chunk = payload + 3;
    size_t chunkLen = static_cast<size_t>(len) - 3;

    // `last` is a boolean flag on the wire; anything but 0/1 is a malformed frame (a desync the parser's checksum didn't catch, or a non-conforming sender). Reject before reassembly rather than coerce a stray value to "more chunks".
    if (last > 1) {
        improvSendError(static_cast<improv::Error>(IMPROV_ERROR_INVALID_OP));
        return;
    }

    // Reassembly and the duplicate guard live in a core helper tested without hardware, leaving only the serial handling here. Bound once at the first call, the buffer being set before the task starts and one task living for the device's lifetime, so it never sees a stale one.
    static mm::ImprovOpReassembler reasm(g_improv.opOut, g_improv.opOutLen);
    switch (reasm.feed(seq, last, chunk, chunkLen)) {
        case mm::ImprovOpReassembler::Result::Error:
            improvSendError(static_cast<improv::Error>(IMPROV_ERROR_INVALID_OP));
            return;
        case mm::ImprovOpReassembler::Result::Continue:
            break;
        case mm::ImprovOpReassembler::Result::Ready:
            // release-store pairs with the module's acquire-load before it applies.
            g_improv.opReady->store(true, std::memory_order_release);
            break;
    }
    // Ack every chunk (empty RpcResponse for 0xFC) so the installer awaits each.
    auto rpc = improv::build_rpc_response(
        static_cast<improv::Command>(IMPROV_CMD_APPLY_OP),
        std::vector<std::string>{}, false);
    improvSend(ImprovFrameType::RpcResponse, rpc);
}

// Dispatch a completed frame from the parser. Only RPC frames carry commands we care about; the spec lets the other types through silently.
static void improvDispatchFrame(const ImprovFrameParser& parser) {
    if (parser.lastType() != improv::TYPE_RPC) return;
    // Vendor RPCs short-circuit the standard improv::parse_improv_data path because that helper is WIFI_SETTINGS-shaped (n length-prefixed strings into ssid/password). Peek at the command byte first; vendor-RPC parsing handles its own payload.
    const uint8_t* raw = parser.lastPayload();
    uint8_t rawLen = parser.lastPayloadLen();
    if (rawLen >= 1 && raw[0] == IMPROV_CMD_SET_TX_POWER) {
        improvHandleSetTxPower(raw, rawLen);
        return;
    }
    if (rawLen >= 1 && raw[0] == IMPROV_CMD_APPLY_OP) {
        improvHandleApplyOp(raw, rawLen);
        return;
    }
    improv::ImprovCommand cmd = improv::parse_improv_data(
        parser.lastPayload(), parser.lastPayloadLen(), false);
    switch (cmd.command) {
        case improv::GET_CURRENT_STATE: {
            // "Connected" means: on WiFi, the STA has an IP; on Ethernet-only, the eth link is up with a DHCP lease. Either way report PROVISIONED + the device URL (the way ESPHome does, makes the protocol self-describing on every reconnect; observable via improv_probe.py). Not connected → AUTHORIZED.
            uint8_t ip[4] = {};
            bool connected = false;
#ifndef MM_NO_WIFI
            if (wifiStaConnected()) { wifiStaGetIPv4(ip); connected = true; }
            else
#endif
            if (ethConnected()) { ethGetIPv4(ip); connected = true; }
            if (connected) {
                improvSendCurrentState(improv::STATE_PROVISIONED);
                if (ip[0] || ip[1] || ip[2] || ip[3]) {
                    char url[64];
                    std::snprintf(url, sizeof(url), "http://%u.%u.%u.%u/", ip[0], ip[1], ip[2], ip[3]);
                    std::vector<std::string> urls = { url };
                    improvSend(ImprovFrameType::RpcResponse,
                               improv::build_rpc_response(improv::WIFI_SETTINGS, urls, false));
                }
            } else {
                improvSendCurrentState(improv::STATE_AUTHORIZED);
            }
            break;
        }
        case improv::GET_DEVICE_INFO: improvSendDeviceInfo(); break;
#ifndef MM_NO_WIFI
        case improv::GET_WIFI_NETWORKS:
            // Refuse scans while WiFi STA is connected, esp_wifi_scan_start puts the radio into scan mode for 2-5 s, dropping inbound ArtNet (a visible glitch on a 16K-LED rig). GET_CURRENT_STATE already reports online.
            if (wifiStaConnected()) improvSendError(improv::ERROR_UNABLE_TO_CONNECT);
            else                    improvSendWifiNetworks();
            break;
        case improv::WIFI_SETTINGS: improvHandleProvision(cmd); break;
#endif
        default:                    improvSendError(improv::ERROR_UNKNOWN_RPC); break;
    }
}

// Feed one byte into the parser and dispatch as needed, the source naming which transport it arrived on so the reply routes back there alone. Reset to both afterwards, so any later unsolicited send broadcasts as before.
static void improvFeedByte(ImprovFrameParser& parser, uint8_t b, ImprovSource source) {
    switch (parser.feed(b)) {
        case ImprovFeedResult::NeedMore:
            break;
        case ImprovFeedResult::FrameReady:
            g_replySource = source;
            improvDispatchFrame(parser);
            g_replySource = ImprovSource::Both;
            break;
        case ImprovFeedResult::BadChecksum:
            g_replySource = source;
            improvSendError(improv::ERROR_INVALID_RPC);
            g_replySource = ImprovSource::Both;
            break;
        case ImprovFeedResult::OversizePayload:
            // Length byte > 128, almost certainly noise / bit-flip; resync silently.
            break;
    }
}

