MoonModules/projectMM/src/platform/esp32/platform_esp32_improv.cpp
static void improvTask(void* /*arg*/) {
    // UART0 driver install. UART0 is already configured at 115200-8N1 by the bootloader; we just claim the interrupt + RX FIFO. RX buf 256 is plenty (Improv RPC payloads max out around 96 bytes).
    bool uartReady = false;
    esp_err_t uart_err = uart_driver_install(UART_NUM_0, 256, 0, 0, nullptr, 0);
    if (uart_err == ESP_OK) {
        uartReady = true;
    } else {
        // Do not park the task, since the other transport may still work on this board; the warning reaches the log and the status below surfaces it in the interface.
        ESP_LOGW(IMPROV_TAG, "uart_driver_install failed: %s",
                 esp_err_to_name(uart_err));
    }

#if SOC_USB_SERIAL_JTAG_SUPPORTED
    // The USB driver install, which on a native-USB board is the interface the host actually talks to; best-effort, since the secondary console may have taken the peripheral first.
    if (!usb_serial_jtag_is_driver_installed()) {
        usb_serial_jtag_driver_config_t jtag_cfg = USB_SERIAL_JTAG_DRIVER_CONFIG_DEFAULT();
        esp_err_t jtag_err = usb_serial_jtag_driver_install(&jtag_cfg);
        if (jtag_err == ESP_OK) {
            g_jtagReady = true;
        } else {
            ESP_LOGW(IMPROV_TAG, "usb_serial_jtag_install failed: %s",
                     esp_err_to_name(jtag_err));
        }
    } else {
        // Someone else already installed it (rare). We can still read + write through it.
        g_jtagReady = true;
    }
#endif

    // If both installs failed, the task has nothing to do. Park it.
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    const bool anyReady = uartReady || g_jtagReady;
#else
    const bool anyReady = uartReady;
#endif
    if (!anyReady) {
        improvSetStatus("error: no transport (uart + jtag install both failed)");
        vTaskDelete(nullptr);
        return;
    }

    // Compound status so a user inspecting `provision_status` can see partial failures (one transport up, the other failed). Without this the listening-state status overwrites any prior warn line and the failure is invisible in the UI.
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (uartReady && g_jtagReady)         improvSetStatus("listening");
    else if (uartReady)                   improvSetStatus("listening (jtag unavailable)");
    else                                   improvSetStatus("listening (uart unavailable)");
#else
    improvSetStatus("listening");
#endif

    // One parser per transport, each with its own framing state and buffer: @xref{two-transports-because-the-port-may-be-either|why sharing one corrupts a partial frame}.
    ImprovFrameParser parser_uart;
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    ImprovFrameParser parser_jtag;
#endif
    uint8_t b;
    for (;;) {
        // A symmetric non-blocking poll of both, draining whichever has data and yielding only when both come up empty. Blocking on one made the other lumpy on a board that has both.
        bool anyRead = false;
        if (uartReady) {
            for (int drained = 0; drained < 64; ++drained) {
                int n = uart_read_bytes(UART_NUM_0, &b, 1, 0);
                if (n <= 0) break;
                improvFeedByte(parser_uart, b, ImprovSource::Uart);
                anyRead = true;
            }
        }
#if SOC_USB_SERIAL_JTAG_SUPPORTED
        if (g_jtagReady) {
            for (int drained = 0; drained < 64; ++drained) {
                int n = usb_serial_jtag_read_bytes(&b, 1, 0);
                if (n <= 0) break;
                improvFeedByte(parser_jtag, b, ImprovSource::Jtag);
                anyRead = true;
            }
        }
#endif
        if (!anyRead) {
            // Nothing on either side, so yield and let lower-priority work run; the wait matches what the blocking poll achieved and is identical from this task's perspective.
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }
}

} // anonymous namespace

bool improvProvisioningInit(const ImprovDeviceInfo& info,
                            char* ssidOut, size_t ssidOutLen,
                            char* passwordOut, size_t passwordOutLen,
                            std::atomic<bool>* ready,
                            char* statusBuf, size_t statusBufLen,
                            uint8_t* txPowerOut,
                            std::atomic<bool>* txPowerReady,
                            char* opOut, size_t opOutLen,
                            std::atomic<bool>* opReady) {
    if (!info.name || !info.chipFamily || !info.firmwareVersion ||
        !ssidOut || ssidOutLen == 0 ||
        !passwordOut || passwordOutLen == 0 ||
        !ready || !statusBuf || statusBufLen == 0) {
        return false;
    }
    std::strncpy(g_improv.name, info.name, sizeof(g_improv.name) - 1);
    std::strncpy(g_improv.chipFamily, info.chipFamily, sizeof(g_improv.chipFamily) - 1);
    std::strncpy(g_improv.firmwareVersion, info.firmwareVersion, sizeof(g_improv.firmwareVersion) - 1);
    g_improv.ssidOut = ssidOut;
    g_improv.ssidOutLen = ssidOutLen;
    g_improv.passwordOut = passwordOut;
    g_improv.passwordOutLen = passwordOutLen;
    g_improv.ready = ready;
    g_improv.statusBuf = statusBuf;
    g_improv.statusBufLen = statusBufLen;
    // SET_TX_POWER opt-in, same shape.
    g_improv.txPowerOut = txPowerOut;
    g_improv.txPowerReady = txPowerReady;
    // APPLY_OP opt-in, same shape (the op reassembly buffer + ready flag).
    g_improv.opOut = opOut;
    g_improv.opOutLen = opOutLen;
    g_improv.opReady = opReady;

    // 6 KB stack: parser is small, scan response uses std::vector + std::string (some short-string-optimized, some heap). Priority 4, below OTA (5), above idle. Single task per device; not pinned to a core.
    BaseType_t ok = xTaskCreate(&improvTask, "improv", 6144, nullptr, 4, nullptr);
    if (ok != pdPASS) {
        improvSetStatus("error: task create failed");
        return false;
    }
    return true;
}

} // namespace mm::platform
